frontend/controllers/HomeController.php

SELECT * FROM `tbl_video` WHERE `status`=1 LIMIT 5
SELECT * FROM `tbl_plan` WHERE `status`=1 ORDER BY `createtime` DESC LIMIT 5
SELECT * FROM `tbl_user` WHERE `status`=1 LIMIT 5
---
    public function actionIndex() {
        $banners = \app\models\extend\Advertisement::getAdByPos('banner');
        $recomVideos = \app\models\extend\Video::find()->where(['status' => 1])->limit(5)->all();
        $latestPlans = \app\models\extend\Plan::find()->where(['status' => 1])->orderBy('createtime desc')->limit(5)->all();
        $recomUsers = \app\models\extend\User::find()->where(['status' => 1])->limit(5)->all();