frontend/controllers/PlanController.php

    public function actionView($id) {
        $model = $this->findModel($id);
        if ($model->status < 0) {
            throw new NotFoundHttpException('该计划已被删除.');
        }
        return $this->render('view', [
                    'model' => $model,
                    'planUsers' => PlanUser::findAll(['plan_id' => $id, 'status' => 0]),
        ]);
---
SELECT * FROM `tbl_plan_user` WHERE (`plan_id`='1') AND (`status`=1)

    protected function findModel($id) {
        if (($model = Plan::findOne($id)) !== null) {
---
SELECT * FROM `tbl_plan` WHERE `id`='1'