frontend/controllers/UserProfileController.php

    public function actionView($uid) {
        return $this->render('view', [
                    'model' => $this->findModel($uid),
                    'userModel' => User::findOne($uid),
---
SELECT * FROM `tbl_user` WHERE `id`='1'

    protected function findModel($uid) {
        if (($model = UserProfile::findOne(['uid' => $uid])) !== null) {
---
SELECT * FROM `tbl_user_profile` WHERE `uid`='1'