frontend/controllers/VideoController.php

    protected function findModel($id) {
        if (($model = Video::findOne($id)) !== null) {
---
SELECT * FROM `tbl_video` WHERE `id`='1'