frontend/models/extend/Advertisement.php

SELECT * FROM `tbl_advertisement` WHERE (`status`=1) AND (`position`='banner') ORDER BY `sort`
---
    public static function getAdByPos($pos) {
        return self::find()->where(['status' => 1, 'position' => $pos])->orderBy('sort asc')->all();