frontend/models/extend/Comment.php

    public static function getChildren($id) {
        return self::find()->where(['parent_id' => $id, 'status' => 1])->orderBy('id desc')->all();
---
SELECT * FROM `tbl_comment` WHERE (`parent_id`=48) AND (`status`=1) ORDER BY `id` DESC