frontend/models/extend/MetaData.php

    public static function getGroupList($groupKey) {
        $data = static::findByCondition(['group_key' => $groupKey, 'status' => 1])->orderBy('sort asc')->all();
---
SELECT * FROM `tbl_meta_data` WHERE (`group_key`='videoType') AND (`status`=1) ORDER BY `sort`

    public static function getVal($id) {
        $data = static::findOne(['id' => $id]);

        return empty($data) ? '' : $data->value;
---
SELECT * FROM `tbl_meta_data` WHERE `id` IS NULL
SELECT * FROM `tbl_meta_data` WHERE `id` IN ('', '45', '40', '')