frontend/models/extend/User.php

SELECT * FROM `tbl_user` WHERE `id`=1
---
    public static function getInfo($id) {
        if (empty(self::$_user[$id])) {
            self::$_user[$id] = self::findOne($id);

SELECT * FROM `tbl_user_profile` WHERE `uid`=1
---
    public function afterFind() {
        if (empty($this->avatar)) {
            $this->avatar = './image/default_avatar.jpg';
        }
        $this->profile = UserProfile::findOne(['uid' => $this->id]);