frontend/models/extend/Video.php

    public static function getVideoList($uid) {
        $data = static::find()->where(['uid' => $uid, 'status' => 1])->orderBy('id desc')->all();
---
SELECT * FROM `tbl_video` WHERE (`uid`=1) AND (`status`=1) ORDER BY `id` DESC