backend/views/meta-data/index.php

    <p>
        <?= Html::a('Create Meta Data', ['create'], ['class' => 'btn btn-success']) ?>
    </p>
    <?= GridView::widget([
        'dataProvider' => $dataProvider,
        'filterModel' => $searchModel,
        'columns' => [
            ['class' => 'yii\grid\SerialColumn'],

            'id',
            //'parent_id',
            //'group_key',
            [
                'attribute' => 'group_key',
                'filter' => MetaData::getGroupKeyArr(),
                'value' => function ($data) {
                    return MetaData::getGroupKeyArr(false, $data->group_key);
                },
            ],
            'mkey',
            'value',
            'sort',
            'status',

            ['class' => 'yii\grid\ActionColumn'],
---
SELECT * FROM `tbl_meta_data` LIMIT 20
SELECT COUNT(*) FROM `tbl_meta_data`