frontend/models/User.php

SELECT * FROM `tbl_user` WHERE `id`=1
---
    public static function findIdentity($id) {
        return static::findOne($id);