frontend/components/comment/CommentWidget.php

    public function run() {
        $model = new Comment();
        $model->vid = $this->vid;
        $model->uid = Yii::$app->user->isGuest ? 0 : Yii::$app->user->identity->id;

        $commentList = Comment::find()->where(['vid' => $this->vid, 'parent_id' => 0, 'status' => 1])->orderBy('id desc')->all();
---
SELECT * FROM `tbl_comment` WHERE (`vid`=1) AND (`parent_id`=0) AND (`status`=1) ORDER BY `id` DESC