backen/controllers/AdvertisementController.php

INSERT INTO `tbl_advertisement` (`name`, `postion`, `url`, `sort`, `status`, `createtime`) VALUES ('时尚大都会', 'banner', '/uploads/2016/05/30/146457756832509.jpg', 0, 1, 1464577592)
---
    public function actionCreate()
    {
        $model = new Advertisement();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `tbl_advertisement` WHERE `id`='1'
---
    protected function findModel($id)
    {
        if (($model = Advertisement::findOne($id)) !== null) {