<?php

/* @var $this yii\web\View */

use yii\helpers\Html;

$this->title = '常见问题';
$this->params['breadcrumbs'][] = $this->title;
?>
<div class="site-about">
    <h1><?= Html::encode($this->title) ?></h1>

    <p>
    <pre>
一、如何组织一次拍摄？
 

1、发布拍摄计划。

2、通过“找拍档”邀请合适的人员加入计划。

3、通过在“拍友秘籍”的“人员招募”板块发帖吸引人员主动申请加入你的计划。

4、与可能的人员进行较详细沟通以确保团队的顺利组建。

5、从我的主页进入“我发布的计划”来进行计划管理与人员管理。

6、线下进行作品的拍摄的同时利用我们的网站进行团队交流和吸引粉丝。

7、上传作品。

 

二、计划发起人上传作品时为团队成员设定贡献度有什么作用？

 

1、对成员在拍摄中的评价与肯定。

2、贡献度的大小关系到该成员的通过该作品获得的经验值与奖金，其中经验值有直

接决定等级。


三、如何获得更多关注与合作机会？

 

1、完善个人头像、联系方式、特长等资料。

2、拍出好的作品并积累经验值与等级就是最好的展示。

3、在留言板和“拍友秘籍”宣传自己的作品，积累粉丝。还可以分享到其它相关平台获得关注。

4、此外，非常剧组也会不断努力，为广大爱好者寻求植入广告、宣传片定制等合作机会。


 

四、为什么我发布了作品和计划却看不到？

 

1、视频刚刚上传后出于审核期，此时他人不可见。

2、视频刚刚通过审核和计划刚刚发布后会在“搜视频”和“加入拍摄”板块显示，如果质量较高才会被推荐到首页显示。

    </pre>
    </p>

</div>
